# Chapter 11. Advanced Searching

In [1]:
%load_ext sql
%sql postgresql://sql-cookbook:sql-cookbook@0.0.0.0:5432/sql-cookbook

## 11.1 Paginating Through a Result Set

In [2]:
%%sql
select *
from emp
order by empno
limit 5 offset 5;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
5 rows affected.

[(7698, 'BLAKE', 'MANAGER', 7839, datetime.date(2006, 5, 1), 2850, None, 30),
 (7782, 'CLARK', 'MANAGER', 7839, datetime.date(2006, 6, 9), 2450, None, 10),
 (7788, 'SCOTT', 'ANALYST', 7566, datetime.date(2007, 12, 9), 3000, None, 20),
 (7839, 'KING', 'PRESIDENT', None, datetime.date(2006, 11, 17), 5000, None, 10),
 (7844, 'TURNER', 'SALESMAN', 7698, datetime.date(2006, 9, 8), 1500, 0, 30)]

## 11.2 Skipping n Rows from a Table

In [3]:
%%sql
with emp as (
    select ename,
           row_number() over (order by ename) as row_number
    from emp
)
select ename
from emp
where row_number % 2 = 1;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
7 rows affected.

[('ADAMS',),
 ('BLAKE',),
 ('FORD',),
 ('JONES',),
 ('MARTIN',),
 ('SCOTT',),
 ('TURNER',)]

## 11.3 Incorporating OR Logic When Using Outer Joins

In [4]:
%%sql
with emp as (
    select *
    from emp
    where deptno in (10, 20)
)
select ename, deptno, dname, loc
from emp natural right join dept;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
10 rows affected.

[('MILLER', 10, 'ACCOUNTING', 'NEW YORK'),
 ('KING', 10, 'ACCOUNTING', 'NEW YORK'),
 ('CLARK', 10, 'ACCOUNTING', 'NEW YORK'),
 ('FORD', 20, 'RESEARCH', 'DALLAS'),
 ('ADAMS', 20, 'RESEARCH', 'DALLAS'),
 ('SCOTT', 20, 'RESEARCH', 'DALLAS'),
 ('JONES', 20, 'RESEARCH', 'DALLAS'),
 ('SMITH', 20, 'RESEARCH', 'DALLAS'),
 (None, 30, 'SALES', 'CHICAGO'),
 (None, 40, 'OPERATIONS', 'BOSTON')]

## 11.4 Determining Which Rows Are Reciprocals

In [5]:
%%sql
with v as (
    select *
    from (values (20, 20),
                 (50, 25),
                 (20, 20),
                 (60, 30),
                 (70, 90),
                 (80, 130),
                 (90, 70),
                 (100, 50),
                 (110, 55),
                 (120, 60),
                 (130, 80),
                 (140, 70))
             as t(test1, test2)
)
select distinct v.*
from v, v vv
where v.test1 <= v.test2
  and v.test2 = vv.test1
  and v.test1 = vv.test2
order by v.test1;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
3 rows affected.

[(20, 20), (70, 90), (80, 130)]

## 11.5 Selecting the Top n Records

In [6]:
%%sql
with emp as (
    select *, row_number() over (order by sal desc) as sal_rank
    from emp
)
select ename, sal
from emp
order by sal_rank
limit 5;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
5 rows affected.

[('KING', 5000),
 ('FORD', 3000),
 ('SCOTT', 3000),
 ('JONES', 2975),
 ('BLAKE', 2850)]

## 11.6 Finding Records with the Highest and Lowest Values

In [7]:
%%sql
with emp as (
    select *,
           min(sal) over () as min_sal,
           max(sal) over () as max_sal
    from emp
)
select ename, sal
from emp
where sal in (min_sal, max_sal);

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
2 rows affected.

[('SMITH', 800), ('KING', 5000)]

## 11.7 Investigating Future Rows

In [8]:
%%sql
with emp as (
    select *, lead(sal) over (order by hiredate) as next_sal
    from emp
)
select ename, sal, hiredate
from emp
where sal < next_sal;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
5 rows affected.

[('SMITH', 800, datetime.date(2005, 12, 17)),
 ('WARD', 1250, datetime.date(2006, 2, 22)),
 ('MARTIN', 1250, datetime.date(2006, 9, 28)),
 ('JAMES', 950, datetime.date(2006, 12, 3)),
 ('MILLER', 1300, datetime.date(2007, 1, 23))]

## 11.8 Shifting Row Values

In [9]:
%%sql
select ename,
       sal,
       coalesce(lead(sal) over (order by sal), min(sal) over ()) as forward,
       coalesce(lag(sal) over (order by sal), max(sal) over ())  as rewind
from emp;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
14 rows affected.

[('SMITH', 800, 950, 5000),
 ('JAMES', 950, 1100, 800),
 ('ADAMS', 1100, 1250, 950),
 ('WARD', 1250, 1250, 1100),
 ('MARTIN', 1250, 1300, 1250),
 ('MILLER', 1300, 1500, 1250),
 ('TURNER', 1500, 1600, 1300),
 ('ALLEN', 1600, 2450, 1500),
 ('CLARK', 2450, 2850, 1600),
 ('BLAKE', 2850, 2975, 2450),
 ('JONES', 2975, 3000, 2850),
 ('FORD', 3000, 3000, 2975),
 ('SCOTT', 3000, 5000, 3000),
 ('KING', 5000, 800, 3000)]

## 11.9 Ranking Results

In [10]:
%%sql
select ename,
       sal,
       dense_rank() over (order by sal) as sal_rank
from emp;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
14 rows affected.

[('SMITH', 800, 1),
 ('JAMES', 950, 2),
 ('ADAMS', 1100, 3),
 ('WARD', 1250, 4),
 ('MARTIN', 1250, 4),
 ('MILLER', 1300, 5),
 ('TURNER', 1500, 6),
 ('ALLEN', 1600, 7),
 ('CLARK', 2450, 8),
 ('BLAKE', 2850, 9),
 ('JONES', 2975, 10),
 ('FORD', 3000, 11),
 ('SCOTT', 3000, 11),
 ('KING', 5000, 12)]

## 11.10 Suppressing Duplicates

In [11]:
%%sql
select distinct job
from emp
order by job;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
5 rows affected.

[('ANALYST',), ('CLERK',), ('MANAGER',), ('PRESIDENT',), ('SALESMAN',)]

In [12]:
%%sql
select job
from emp
group by job
order by job;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
5 rows affected.

[('ANALYST',), ('CLERK',), ('MANAGER',), ('PRESIDENT',), ('SALESMAN',)]

In [13]:
%%sql
with emp as (
    select *, row_number() over (partition by job) as row_number
    from emp
)
select job
from emp
where row_number = 1;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
5 rows affected.

[('ANALYST',), ('CLERK',), ('MANAGER',), ('PRESIDENT',), ('SALESMAN',)]

## 11.11 Finding Knight Values

In [14]:
%%sql
with emp as (
    select deptno,
           ename,
           sal,
           hiredate,
           case
               when hiredate = max(hiredate) over (partition by deptno) then sal
               else 0
               end as latest_sal
    from emp
)
select deptno,
       ename,
       sal,
       hiredate,
       max(latest_sal) over (partition by deptno) as latest_sal
from emp;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
14 rows affected.

[(10, 'MILLER', 1300, datetime.date(2007, 1, 23), 1300),
 (10, 'CLARK', 2450, datetime.date(2006, 6, 9), 1300),
 (10, 'KING', 5000, datetime.date(2006, 11, 17), 1300),
 (20, 'SCOTT', 3000, datetime.date(2007, 12, 9), 1100),
 (20, 'JONES', 2975, datetime.date(2006, 4, 2), 1100),
 (20, 'SMITH', 800, datetime.date(2005, 12, 17), 1100),
 (20, 'ADAMS', 1100, datetime.date(2008, 1, 12), 1100),
 (20, 'FORD', 3000, datetime.date(2006, 12, 3), 1100),
 (30, 'WARD', 1250, datetime.date(2006, 2, 22), 950),
 (30, 'TURNER', 1500, datetime.date(2006, 9, 8), 950),
 (30, 'ALLEN', 1600, datetime.date(2006, 2, 20), 950),
 (30, 'BLAKE', 2850, datetime.date(2006, 5, 1), 950),
 (30, 'MARTIN', 1250, datetime.date(2006, 9, 28), 950),
 (30, 'JAMES', 950, datetime.date(2006, 12, 3), 950)]

## 11.12 Generating Simple Forecasts

In [15]:
%%sql
with orders as (
    select *
    from (values (1, '25-SEP-2005'::date, '27-SEP-2005'::date),
                 (2, '26-SEP-2005'::date, '28-SEP-2005'::date),
                 (3, '27-SEP-2005'::date, '29-SEP-2005'::date))
             as t(id, order_date, process_date)
)
select *,
       unnest(array [null, process_date + 1, process_date + 1]) as verified,
       unnest(array [null, null, process_date + 2])             as shipped
from orders;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
9 rows affected.

[(1, datetime.date(2005, 9, 25), datetime.date(2005, 9, 27), None, None),
 (1, datetime.date(2005, 9, 25), datetime.date(2005, 9, 27), datetime.date(2005, 9, 28), None),
 (1, datetime.date(2005, 9, 25), datetime.date(2005, 9, 27), datetime.date(2005, 9, 28), datetime.date(2005, 9, 29)),
 (2, datetime.date(2005, 9, 26), datetime.date(2005, 9, 28), None, None),
 (2, datetime.date(2005, 9, 26), datetime.date(2005, 9, 28), datetime.date(2005, 9, 29), None),
 (2, datetime.date(2005, 9, 26), datetime.date(2005, 9, 28), datetime.date(2005, 9, 29), datetime.date(2005, 9, 30)),
 (3, datetime.date(2005, 9, 27), datetime.date(2005, 9, 29), None, None),
 (3, datetime.date(2005, 9, 27), datetime.date(2005, 9, 29), datetime.date(2005, 9, 30), None),
 (3, datetime.date(2005, 9, 27), datetime.date(2005, 9, 29), datetime.date(2005, 9, 30), datetime.date(2005, 10, 1))]

In [16]:
%%sql
with
    orders as (
        select *
        from (values (1, '25-SEP-2005'::date, '27-SEP-2005'::date),
                     (2, '26-SEP-2005'::date, '28-SEP-2005'::date),
                     (3, '27-SEP-2005'::date, '29-SEP-2005'::date))
                 as t(id, order_date, process_date)
    ),
    stages as (
        select stage, null as verified, null as shipped
        from generate_series(1, 3) stage
    )
select id,
       order_date,
       process_date,
       case when stage > 1 then process_date + 1 end as verified,
       case when stage > 2 then process_date + 2 end as shipped
from orders, stages
order by id, stage;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
9 rows affected.

[(1, datetime.date(2005, 9, 25), datetime.date(2005, 9, 27), None, None),
 (1, datetime.date(2005, 9, 25), datetime.date(2005, 9, 27), datetime.date(2005, 9, 28), None),
 (1, datetime.date(2005, 9, 25), datetime.date(2005, 9, 27), datetime.date(2005, 9, 28), datetime.date(2005, 9, 29)),
 (2, datetime.date(2005, 9, 26), datetime.date(2005, 9, 28), None, None),
 (2, datetime.date(2005, 9, 26), datetime.date(2005, 9, 28), datetime.date(2005, 9, 29), None),
 (2, datetime.date(2005, 9, 26), datetime.date(2005, 9, 28), datetime.date(2005, 9, 29), datetime.date(2005, 9, 30)),
 (3, datetime.date(2005, 9, 27), datetime.date(2005, 9, 29), None, None),
 (3, datetime.date(2005, 9, 27), datetime.date(2005, 9, 29), datetime.date(2005, 9, 30), None),
 (3, datetime.date(2005, 9, 27), datetime.date(2005, 9, 29), datetime.date(2005, 9, 30), datetime.date(2005, 10, 1))]